<details ><summary>apply for production 2025-10-30 20:18:46 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudflare_dns_record.bsky_record will be created
  + resource "cloudflare_dns_record" "bsky_record" {
      + content          = "did=did:plc:r74f3l5bzuodnjekrf364t2v"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_atproto"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dmarc will be created
  + resource "cloudflare_dns_record" "dmarc" {
      + content          = "v=DMARC1; p=quarantine; rua=mailto:me@mirror-kt.dev; ruf=mailto:me@mirror-kt.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_dmarc"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dub_sh will be created
  + resource "cloudflare_dns_record" "dub_sh" {
      + content          = "cname.dub.sh"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "s"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.github_pages_challenge will be created
  + resource "cloudflare_dns_record" "github_pages_challenge" {
      + content          = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_github-pages-challenge-mirror-kt"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.google_workspace will be created
  + resource "cloudflare_dns_record" "google_workspace" {
      + content          = "google-site-verification=HOfSNNDUwvlVJsp2TP7dwJCBub6fX7-Kpw1VGXZ2Ogg"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.keybase will be created
  + resource "cloudflare_dns_record" "keybase" {
      + content          = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_keybase"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.mail will be created
  + resource "cloudflare_dns_record" "mail" {
      + content          = "smtp.google.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + priority         = 1
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "MX"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.root will be created
  + resource "cloudflare_dns_record" "root" {
      + content          = "mirror-kt.pages.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.spf will be created
  + resource "cloudflare_dns_record" "spf" {
      + content          = "v=spf1 include:_spf.google.com ~all"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
cloudflare_dns_record.mail: Creating...
cloudflare_dns_record.google_workspace: Creating...
cloudflare_dns_record.spf: Creating...
cloudflare_dns_record.dub_sh: Creating...
cloudflare_dns_record.github_pages_challenge: Creating...
cloudflare_dns_record.bsky_record: Creating...
cloudflare_dns_record.keybase: Creating...
cloudflare_dns_record.root: Creating...
cloudflare_dns_record.dmarc: Creating...
cloudflare_dns_record.github_pages_challenge: Creation complete after 1s [id=d94450088a0fbc53c70679d975a1656b]
cloudflare_dns_record.dmarc: Creation complete after 1s [id=0f8c7a70f6f5328dccf5d75b07153004]
cloudflare_dns_record.google_workspace: Creation complete after 1s [id=ba7ba53310b1485c765046efc789af3d]
cloudflare_dns_record.bsky_record: Creation complete after 1s [id=e16534fbb20a274d3448d401da5619e8]
cloudflare_dns_record.keybase: Creation complete after 1s [id=9b79fc9825311c859ae3b24d0d44d23d]
cloudflare_dns_record.mail: Creation complete after 1s [id=9cefe80d8a59a3b47f2ba06e994ed0b9]
cloudflare_dns_record.root: Creation complete after 1s [id=4c94fa3983057fa4f5b51ebffd2522fa]
cloudflare_dns_record.dub_sh: Creation complete after 1s [id=edcc78d9a3d79b03f033114b68e21025]
cloudflare_dns_record.spf: Creation complete after 1s [id=663506785f5b49cc02bda09d6e91f0bf]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.

```
</details>
</details>